import { Level } from '../scripts/types';

let levels: Level[] = [];

levels.push(new Level({
    lab: [
        '              ',
        '              ',
        '              ',
        '              ',
        '     0        ',
        '              ',
        '              ',
        '          1   ',
        '              ',
        '              ',
        '              ',
        '              ',
        '              ',
        '              ',
        '              ',
        '              ',
    ],
    title: 'Потерянная',
    chat: [
        {
            text: 'Здраствуй, потерянная звезда! Я – планета, обитающая в этом удивительном уголке галактики',
            set: 'nice',
        },
        {
            text: 'Ты почти потухла. Видя твое сияние, я распахнула свои двери, чтобы помочь тебе',
        },
        {
            text: 'Меня называют планетой умиротворения. А эти голоса, что ты слышишь, это люди населяющие меня',
        },
        {
            text: 'Откуда же ты, маленькая заблудившаяся звезда, потерявшая свой путь среди вселенных троп?',
        },
        {
            text: 'Но не бойся, любая звезда на то и создана, чтобы найти свое истинное созвездие',
        },
        {
            text: 'Чтобы помочь тебе на этом путешествии, я дарую тебе частичку своей силы.',
        },
        {
            text: 'Ты будешь летать своим сияющим обликом, проникая сквозь вихри и переплетения моей орбиты',
        },
        {
            text: 'И так готова ли ты отправиться в это путешествие через мои лабиринты и загадки и открыть свое сияние?',
        },
    ],
}));

levels.push(new Level({
    lab: [
        '              ',
        '              ',
        '            ★ ',
        '              ',
        '              ',
        '              ',
        '    0         ',
        '              ',
        '              ',
        '      ★       ',
        '              ',
        '              ',
        '              ',
        '              ',
        '     1    ★   ',
        '              ',
    ],
    title: 'Подающая звезда',
    chat: [
        {
            text: 'В процессе своего путешествия ты будешь обнаруживать особые звезды, которые отражают уникальные качества и энергию каждой планеты.',
            set: 'nice',
        },
        {
            text: 'Собирай их, чтобы отыскать новые миры и раскрыть их секреты.',
        },
        {
            text: 'Каждая звезда, запечатлевает частицу света и мудрости. Когда ты соберешь достаточное количество звезд, перед тобой откроются новые пути',
        },
        {
            text: 'Каждая планета имеет свои собственные уникальные ландшафты, преграды и скрытые возможности',
        },
        {
            text: 'Только путешествуя через все планеты и собирая все звезды, ты сможешь найти свое истинное созвездие и вернуться домой',
        },
        {
            text: 'А теперь иди и собери их так много сколько сможешь в себя впитать',
        },
    ],
}));

levels.push(new Level({
    lab: [
        '################',
        '# 0            #',
        '#            ★ #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '# ★      ★    1#',
        '#              #',
        '################',
    ],
    title: 'Стены',
    chat: [
        {
            text: 'Однако, потерянная звезда, будь осторожна и избегай стен, которые окружают эти лабиринты',
            set: 'nice',
        },
        {
            text: 'Эти стены, будучи частью этих мистических лабиринтов, служат испытанием для тебя',
        },
        {
            text: 'Они тестируют твою мудрость, и точность управления своим сияющим обликом',
        },
        {
            text: 'Будь внимательна к каждому движению, чтобы не сбиться с пути',
        },
        {
            text: 'Будь решительной и осторожной, и я уверен, что ты преодолеешь все испытания, чтобы найти свой путь домой',
        },
    ],
}));

levels.push(new Level({
    lab: [
        '################',
        '# 0  #         #',
        '#    #       ★ #',
        '#    #         #',
        '#    ######    #',
        '#              #',
        '#              #',
        '#      #       #',
        '#      #       #',
        '#      #       #',
        '#              #',
        '#######     ★  #',
        '#              #',
        '# ★           1#',
        '#              #',
        '################',
    ],
    title: '4 планеты',
    chat: [
        {
            text: 'Давным-давно, когда Вселенная была еще молода, каждая планета и звезда в ней имели свободу и безграничные возможности',
            set: 'nice',
        },
        {
            text: 'Они светили и двигались по своим орбитам в гармонии, создавая красивые пейзажи в космическом пространстве',
        },
        {
            text: 'Однако, со временем, сила и энергия Вселенной начали дисбалансироваться',
        },
        {
            text: 'Звезды и планеты, потерявшее свою гармонию, стали блуждать и заблудились среди безмолвных пространств',
        },
        {
            text: 'В этом хаосе родились 4 планеты: планета горя, планета страха, планета ненависти и я',
        },
        {
            text: 'Чтобы сохранить порядок и восстановить баланс во Вселенной, мудрые старейшины приняли решение создать эти стены',
        },
        {
            text: 'Эти стены имели силу удерживать блуждающие звезды и планеты, направляя их к своим истинным местам',
        },
        {
            text: 'Но у них ничего не вышло, и они остались обломками парить в наших орбитах',
        },
    ],
}));

levels.push(new Level({
    lab: [
        '################',
        '# 0            #',
        '#              #',
        '#    #         #',
        '#    #    ######',
        '#    #         #',
        '#              #',
        '#      #       #',
        '#   ####       #',
        '#      #       #',
        '#              #',
        '#              #',
        '# ####         #',
        '# ★★ #        1#',
        '# ★  #         #',
        '################',
    ],
    title: 'Выбор',
}));

levels.push(new Level({
    lab: [
        '################',
        '#              #',
        '#  0           #',
        '#              #',
        '############   #',
        '#          #   #',
        '#          #   #',
        '#  #####   #   #',
        '#  #1      #   #',
        '#  #       #   #',
        '#  #########   #',
        '#              #',
        '#              #',
        '#     ####     #',
        '#              #',
        '################',
    ],
    title: 'Змейка',
    chat: [
        {
            text: 'Некоторые лабиринты мне напоминает разные формы. Этот я называю змейкой из-за его изогнутости',
            set: 'nice',
        },
        {
            text: 'А как мне называть тебя, маленькая звезда? ...ой, кажется, у тебя ещё нет своего названия...',
        },
        {
            text: 'Обычно звездам дают название, когда один только их свет живет годами после их смерти и наполняет собою планеты',
        },
        {
            text: 'Бывают и исклчения, одним дают название за то они ярче других и оберегая направлют других',
        },
        {
            text: 'Другим дают названия за то, что те летят, сжигая себя, и теряя контроль умирают с шумом врезавшись в одну из планет',
        },
        {
            text: 'Интересно, за что получишь свое название ты?',
        },
    ]
}));

levels.push(new Level({
    lab: [
        '################',
        '#       #      #',
        '#  0    #      #',
        '#           ####',
        '#   #   #  #   #',
        '##        #    #',
        '#    ###  #    #',
        '#              #',
        '#####    #     #',
        '#           1  #',
        '#  #   #       #',
        '#        ####  #',
        '###  #    #    #',
        '#     #  ##    #',
        '#              #',
        '################',
    ],
    title: 'Обломки',
}));

levels.push(new Level({
    lab: [
        '################',
        '#              #',
        '#  0           #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#              #',
        '#         1    #',
        '#              #',
        '################',
    ],
    title: 'Конец?',
    chat: [
        {
            text: 'О, путешественник ночного неба, боюсь тебе нет места на моей орбите, тебя сносит звездный ветер',
            set: 'nice',
        },
        {
            text: 'Пойми, что твое истинное место раскрывается лишь в мгновение вдохновения',
        },
        {
            text: 'Поддайся звездному ветру - ветру великих возможностей, и пусть его песнь перенесет тебя через границы сомнений и страхов',
        },        
        {
            text: 'Следуй своим путем, о потерянная звезда, и найдешь свое истинное место, где небеса и земля объединяются в танце',
        },
        {
            text: 'И помни, что настоящая цель потерянной звезды — не просто воссоединение с небесными друзьями',
        },
        {
            text: 'А обнаружение и осознание ее собственной уникальности в этом бескрайнем космосе',
        },
        {
            text: 'Итак, позволь твоему свету вести тебя сквозь тайны и позволь себе открыть новые горизонты в этой необъятной Вселенной',
        },
    ],
}));
export default levels;
