import { Level } from '../scripts/types';

let levels: Level[] = [];

levels.push(new Level({
    lab: [
        '#--------------#',
        '| 0            |',
        '|            ★ |',
        '|              |',
        '|              |',
        '|              |',
        '|              |',
        '|              |',
        '|              |',
        '|              |',
        '|              |',
        '|              |',
        '|              |',
        '| ★      ★    1|',
        '|              |',
        '#--------------#',
    ],
    title: 'Ну поехали!',
    chat: [
        {
            text: 'Что? Кто ты такой?... Как ты здесь оказлся?',
        },
        {
            text: 'Постой ка... Ты же тот великий волшебник, о котором все говорят',
        },
        {
            text: 'Посотрим как ты справишься с этой задачей',
        },
        {
            text: 'Волшебник, мать его....',
        }
    ],
}));

levels.push(new Level({
    lab: [
        '################',
        '# 0  #         #',
        '#    #       ★ #',
        '#    #         #',
        '#    ######    #',
        '#              #',
        '#              #',
        '#      #       #',
        '#      #       #',
        '#      #       #',
        '#              #',
        '#######     ★  #',
        '#              #',
        '# ★           1#',
        '#              #',
        '################',
    ],
    title: 'Ну поехали!',
}));

levels.push(new Level({
    lab: [
        '################',
        '# 0            #',
        '#              #',
        '#    #         #',
        '#    #    ######',
        '#    #         #',
        '#              #',
        '#      #       #',
        '#   ####       #',
        '#      #       #',
        '#              #',
        '#              #',
        '# ####         #',
        '# ★★ #       1#',
        '# ★  #         #',
        '################',
    ],
    title: 'Ну поехали!',
}));

export default levels;
