import { Level } from '../scripts/types';

let levels: Level[] = [];

levels.push(new Level({
    lab: [
        '################',
        '#      0       #',
        '######~~~#######',
        '#              #',
        '#              #',
        '#           ★  #',
        '#              #',
        '#              #',
        '#              #',
        '#   ★          #',
        '#              #',
        '#          ★   #',
        '#              #',
        '#             1#',
        '#              #',
        '################',
    ],
    title: 'Ну поехали!',
    enemyMode: true,
    chat: [
        {
            text: 'Советую не спешить',
        },
    ],
}));


levels.push(new Level({
    lab: [
        '################',
        '# 0  #         #',
        '#            ★ #',
        '#    #         #',
        '#   ######~~~~~#',
        '#              #',
        '#              #',
        '#      #       #',
        '#      #       #',
        '#   ★  ~       #',
        '#      ~       #',
        '########   ★   #',
        '#              #',
        '#             1#',
        '#              #',
        '################',
    ],
    title: 'Ну поехали!',
    enemyMode: true,
    chat: [],
}));


export default levels;
